app/app/controllers/home_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC
SELECT "users".* FROM "users"
SELECT "topics".* FROM "topics"
---
  def index
    @posts = Post.all
    @users = User.all
    @topics = Topic.all