app/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at desc')
    @selected_posts = Post.page(params[:page]).per(25).by_topic(params[:topics])
---
SELECT "posts".* FROM "posts" ORDER BY created_at desc
SELECT "posts".* FROM "posts"

  def show
    @posts = Post.all.order('created_at desc')
    @post.viewCount = @post.viewCount + 1
    @post.save
---
INSERT INTO "posts" ("name", "body", "commentCount", "viewCount", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "posts" SET "viewCount" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["viewCount", 25], ["updated_at", "2020-05-20 06:59:18.830924"], ["id", 6]]

  def create
    @post = Post.new(post_params)
    @post.author = @current_user.username
    @post.user = @current_user


    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "body", "author", "created_at", "updated_at", "user_id", "topic_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Hello World 2"], ["body", "igo"], ["author", "jess"], ["created_at", "2020-05-24 06:31:57.535257"], ["updated_at", "2020-05-24 06:31:57.535257"], ["user_id", 3], ["topic_id", 2]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Hi hi"], ["updated_at", "2020-05-18 05:28:39.333151"], ["id", 1]]

     def current_user
      if session[:user_id]
        @current_user ||= User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]