app/app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("topicName", "created_at", "updated_at") VALUES (?, ?, ?)  [["topicName", "A.I"], ["created_at", "2020-05-09 07:11:33.131936"], ["updated_at", "2020-05-09 07:11:33.131936"]]

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]