app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("phone", "username", "password_digest", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Jessiah"], ["password_digest", "$2a$12$veDT91lTD3C9iNFHM26flejKdpX12WliTPr8gVBhNcXXwJEW6.zVa"], ["updated_at", "2020-05-25 04:16:40.108724"], ["id", 1]]