app/app/views/home/index.html.erb

    <div class="sideItem">
    <% @posts = Post.order('viewCount desc').limit(5)%>
---
SELECT "posts".* FROM "posts" ORDER BY viewCount desc LIMIT ?  [["LIMIT", 5]]