app/app/views/home/index.html.erb

SELECT "topics".* FROM "topics"
---
    <h4> Topic Filter: </h4>
    <% @topicfilter = Topic.all %>

SELECT "posts".* FROM "posts" ORDER BY viewCount desc LIMIT ?  [["LIMIT", 5]]
---
      <div class="sideItem">
      <% @posts = Post.order('viewCount desc').limit(5)%>