app/app/views/home/index.html.erb

            <div class="card-icon">
              <%= link_to @users.find(post.user_id) do %>
                <%= image_tag @users.find(post.user_id).gravatar_url, :class => "gravatar" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

              <div class="card-info">
                <%= link_to @users.find(post.user_id) do %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

                <% end %>
                Created  <%= time_ago_in_words(post.created_at, include_seconds: true )  %> ago.
                <%= @topics.find(post.topic_id).topicName %></h3>
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      <tbody>
      <% @posts = Post.where(:topic => 1).order('created_at asc')  %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ? ORDER BY created_at asc  [["topic_id", 1]]

            <%= link_to post do %>
                <%= image_tag @users.find(post.user_id).gravatar_url, :class => "gravatar" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

                <h3><%= post.name %></h3>
                <h3><%= Topic.all.find(post.topic_id).topicName %></h3>
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    <div class="sideItem">
    <% @posts = Post.order('viewCount desc').limit(5)%>
---
SELECT "posts".* FROM "posts" ORDER BY viewCount desc LIMIT ?  [["LIMIT", 5]]